#Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

A = int(input('Задайте координату 1: '))
B = int(input('Задайте координату 2: '))
C = int(input('Задайте координату 3: '))
D = int(input('Задайте координату 4: '))
dl = ((C-A)**2 + (D-B)**2)
num = dl
sqrt = num ** (0.5)
print(sqrt)



    


